## Importing Libraries and Data

In [2]:
# import libraries
import pandas as pd
import numpy as np 
import os

In [4]:
# path
path = r'/Users/michele/Desktop/CF/files/Module4/Instacart'

In [6]:
# import orders_products_agg.pkl
df_ords_prods = pd.read_pickle(os.path.join(path, 'Data', 'Prepared', 'orders_products_agg.pkl'))

In [8]:
# import customers dataset only first 1000 rows
df_cst_tst = pd.read_csv(os.path.join(path, 'Data', 'Original', 'customers.csv'), nrows = 1000)

In [10]:
# preliminary check of df_cst_tst
df_cst_tst.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [12]:
# import full datatset 
df_cst = pd.read_csv(os.path.join(path, 'Data', 'Original', 'customers.csv'), index_col = False)

## Data Wrangling

In [14]:
# preliminary check of df_cst
df_cst.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [16]:
df_cst.shape

(206209, 10)

In [18]:
df_cst.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [22]:
# change name of First Name, Surnam, Gender, STATE, Age, n_dependants cols
df_cst.rename(columns ={'First Name' : 'first_name', 'Surnam' : 'surname', 'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age', 'n_dependants' : 'n_dependents'}, inplace = True)

In [24]:
df_cst.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependents,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [16]:
# change data type for user_id col
df_cst['user_id'] = df_cst['user_id'].astype('str')

In [18]:
df_cst['user_id'].dtype

dtype('O')

## Consistency Check

In [26]:
# look for mixed data type
for col in df_cst.columns.tolist():
  weird = (df_cst[[col]].map(type) != df_cst[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cst[weird]) > 0:
    print (col)

first_name

In [28]:
# change data type for first_name col
df_cst['first_name'] = df_cst['first_name'].astype('str')

In [30]:
df_cst['first_name'].dtype

dtype('O')

In [32]:
# look for missing values 
df_cst.isnull().sum()

user_id         0
first_name      0
surname         0
gender          0
state           0
age             0
date_joined     0
n_dependents    0
fam_status      0
income          0
dtype: int64

In [34]:
# look for duplicates
df_dups = df_cst[df_cst.duplicated()]

## Merging Dataframes

In [36]:
# check data type for df_ords_prods
df_ords_prods.dtypes

Unnamed: 0                   int64
order_id                     int64
user_id                      int64
order_number                 int64
order_days_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
_merge                    category
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
exists                    category
max_order                    int64
loyalty_flag                object
avg_spend                  float64
Spending_flag               object
median_time                float64
Regularity_flag             object
dtype: object

In [38]:
# change data type for user_id to be able to merge dfs
df_ords_prods['user_id'] = df_ords_prods['user_id'].astype('str')

In [39]:
# merge df_ords_prods and df_cst
df_merged = df_ords_prods.merge(df_cst, on = 'user_id', indicator = 'True')

In [42]:
df_merged.head()

,Unnamed: 0,order_id,user_id,order_number,order_days_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,first_name,surname,gender,state,age,date_joined,n_dependents,fam_status,income,True
0,0,2539329,1,1,2,8,0.0,196,1,0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,0,2539329,1,1,2,8,0.0,14084,2,0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,0,2539329,1,1,2,8,0.0,12427,3,0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,0,2539329,1,1,2,8,0.0,26088,4,0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,0,2539329,1,1,2,8,0.0,26405,5,0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [45]:
# check the merge
df_merged['True'].value_counts()

True
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [47]:
df_ords_prods.shape

(32404859, 22)

In [49]:
df_merged.shape

(32404859, 32)

In [51]:
# final df without the indicators
df_merged = df_merged.drop(columns = ['_merge', 'True', 'exists', 'Unnamed: 0'])

## Exporting Dataframe

In [53]:
# export df_merged
df_merged.to_pickle(os.path.join(path, 'Data', 'Prepared', 'orders_products_customers.pkl'))